In [ ]:
import numpy as np
import pandas as pd

In [46]:
#pandas operations
#conditional selection
#access rows & columns
#add & delete columns
#concatenation, merging & joining dataframes
#handling missing values
#apply()

In [47]:
d={"USN":[100,101,102],
  "Name":["jerry","tom","ramesh"],
  "Mobile":[99,88,77],
  "Marks":[30,35,32]}

In [48]:
std=pd.DataFrame(d)

In [49]:
std

   USN    Name  Mobile  Marks
0  100   jerry      99     30
1  101     tom      88     35
2  102  ramesh      77     32

In [50]:
#dataframe operations
#head-displaing rows 
#method associated wth data frame
#display all by default
#parameter passed, display rows as per parameter
std.head()

   USN    Name  Mobile  Marks
0  100   jerry      99     30
1  101     tom      88     35
2  102  ramesh      77     32

In [51]:
std.head(2)

   USN   Name  Mobile  Marks
0  100  jerry      99     30
1  101    tom      88     35

In [52]:
std.info()
#give all the infromation about dataframe

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   USN     3 non-null      int64
 1   Name    3 non-null      object
 2   Mobile  3 non-null      int64
 3   Marks   3 non-null      int64
dtypes: int64(3), object(1)
memory usage: 224.0+ bytes

In [53]:
std.columns
#list of columns in dataframe

Index(['USN', 'Name', 'Mobile', 'Marks'], dtype='object')

In [54]:
std.isnull()

     USN   Name  Mobile  Marks
0  False  False   False  False
1  False  False   False  False
2  False  False   False  False

In [55]:
#accessing columns
std["USN"]

0    100
1    101
2    102
Name: USN, dtype: int64

In [56]:
#accessing multiple columns
std[["USN","Marks"]]

   USN  Marks
0  100     30
1  101     35
2  102     32

In [57]:
#access rows
std.loc[1]
#returns row

USN       101
Name      tom
Mobile     88
Marks      35
Name: 1, dtype: object

In [58]:
#create a dataframe cars having the attributes carid , carename
D={"CarId":[1,2,3,4,5,6],
  "CarName":["a","b","c","d","e",None]}

In [59]:
std=pd.DataFrame(D)

In [60]:
\+
std

   CarId CarName
0      1       a
1      2       b
2      3       c
3      4       d
4      5       e
5      6    None

In [61]:
std.isnull()

   CarId  CarName
0  False    False
1  False    False
2  False    False
3  False    False
4  False    False
5  False     True

CarId      3
CarName    c
Name: 2, dtype: object

In [66]:
newdf=std['Marks']>30

KeyError: 'Marks'

In [67]:
std[newdf]

NameError: name 'newdf' is not defined